{
	"Protocolsssss": {
	    "Protocolss": [{
            "field_name": "DOI.ISBN",
            "name_in_csv": "publication_DOI_ISBN",
            "database_model":"publication",
            "field_description": "This entry records the Digital Object Identifier (DOI) or International Standard Book Number (ISBN) codes that identify the source material. In more recent papers you may find the DOI somewhere at the beginning of the paper. You may also search for it in the Web of Knowledge. Step 1. Use the DOI resolution service at dx.doi.org to confirm the DOI of the paper you are digitizing. Do this by appending the DOI after this web page. For example, DOI 10.1111.1365-2745.12334 -> dx.doi.org 10.1111.1365-2745.12334. Step 2. Use the automated publication information tool to auto complete the other publication fields. If no DOI is available use NA and complete the other publication fields by hand. Note. older references may not actually have a DOI.", 
            "field_short_description": "Digital Object Identifier (DOI) or International Standard Book Number (ISBN) codes that identify the source material"
        }, {
            "field_name": "Journal",
            "name_in_csv": "publication_journal_name",
            "database_model":"publication",
            "field_description": "Record the name of the journal from which data were sourced. We use the standard abbreviation of the journal using the BIOSIS Format. ; If the data were sourced from a book, thesis, report, or conference talk or poster, record that as appropriate. For journal abbreviations see list here: images.webofknowledge.comWOK46helpWOSA_abrvjt.html. If no abbreviation is available in both of those list, take a look into the paper. Often there are abbreviations in the left corner of the paper or at the first page. For example, J. Ecol. for Journal of Ecology. Book - Matrices are from a book, or book chapter. Note: If our source is a book name the author of the related chapter in Authors, not the author of the book.PhD thesis - Matrices are from a doctoral thesis. MSc thesis - Matrices are from a masters thesis. Report - Matrices are from a report. Conference talk - Matrices reported in a conference talk. Conference poster - Matrices reported in a conference poster.",
            "field_short_description": "The name of the journal from which data were sourced"
        },{
            "field_name": "Title",
            "name_in_csv": "publication_title",
            "database_model":"publication",
            "field_description": "Record the title of the paper or source from which data were sourced.",
            "field_short_description": "The title of the paper from which data were sourced"
        },{
            "field_name": "Authors",
            "name_in_csv": "publication_authors",
            "database_model":"publication",
            "field_description": "Last name of all authors on the publication. Separate multiple names with ; Note that all authors named in the publication should be recorded in the same order as in the publication. E.g. for the Compadre-paper: Salguero-Gómez; Jones; Archer; Buckley; Che-Castaldo; Caswell; Scheuerlein; Conde; Baudisch; Brinks; de Buhr; Farack; Gottschalk; Hartmann; Henning; Hoppe; Römer; Runge; Ruoff T; Wille J; Zeh; Vieregg; Altwegg; Colchero; Dong; Hodgson; de Kroon; Lebreton; Metcalf; Neel; Parker; Takada; Valverde; Vélez-Espino; Wardle; Franco; Vaupel.",
            "field_short_description": "Last name of all authors on the publication"
        },{
            "field_name": "Year Publication",
            "name_in_csv": "publication_year",
            "database_model":"publication",
            "field_description": "Year of publication of the source publication. This should be recorded as YYYY (e.g. 2002).",
            "field_short_description": "Year of publication of the source publication"
        },{
            "field_name": "Embargo",
            "name_in_csv": "publication_embargo",
            "database_model":"publication",
            "field_description": "If the author does not wish to make personally communicated data available, the data will be under embargo until the following date. At that point, an automatic reminder will go out to the author. The data will not become public until explicit permission has been given by the author. The date should be recorded in US date format (mm.dd.yyyy), or as NA when there if no embargo.",
            "field_short_description": "Date field for when data can be released to the public"
        },{
            "field_name": "Publication Purposes",
            "name_in_csv": "publication_purpose_etc",
            "database_model":"publication",
            "field_description": "A true or false description of the purpose of the study detailed in the manuscript. Several purposes are possible per study and for each purpose TRUE or FALSE must be entered (representing that it was a purpose, or was not a purpose, respectively). ; This information is usually obvious from the abstract and the last paragraph of the intro. For more information on purposes please see the purposes meta-table.",
            "field_short_description": "A true or false description of the purposes of the original study"
        },{
            "field_name": "Notes",
            "name_in_csv": "publication_study_notes",
            "database_model":"publication",
            "field_description": "This column is intended to record any important issues or general notes about the data for the use of the COMPADRINO team. These entries should only include sensible informative key points that others can understand. As with all variables in the database, use English only.",
            "field_short_description": "Notes on digitization issues with the publication or important information about the publication itself"
        },{
            "field_name": "Assigned Student",
            "name_in_csv": "publication_student",
            "database_model":"publication",
            "field_description": "your compadrino user name that you set-up during log-in. This must contain your first name.",
            "field_short_description": "username of assigned compadrino or moderator"
        },{
            "field_name": "Publication Additional Source",
            "name_in_csv": "publication_additional_source_string",
            "database_model": "publication",
            "field_description": "Record additional source(s) used to reconstruct the matrix, or to obtain additional ancillary data. This should be formatted as Lastname Journal YearPublication additional information, e.g. Godinez-Alvarez Bot Rev 2003, or e.g. Schmidt J Ecol 2007 Appendix A1",
            "field_short_description": "Supplementary data source"
        },{
            "field_name": "Corresponding Author Name",
            "name_in_csv": "publication_corresponding_author",
            "database_model":"publication",
            "field_description": "Last name of corresponding author(s). Note that the corresponding author may not necessarily be the first author. When no author is named as the corresponding one in the paper we use the first author. Separate multiple names with ; when pertinent.",
            "field_short_description": "Last name of corresponding author(s)"
        },{
            "field_name": "Corresponding Author Email",
            "name_in_csv": "publication_corresponding_email",
            "database_model":"publication",
            "field_description": "For communication with the corresponding author record the email address. The author's email address can be obtained from the publication, from related papers, from internet searches, and personal communication etc. ; step 2. also enter the year in which the email address last worked or when the paper has been published to distinguish between old and new addresses. If email address doesn't work anymore enter dead instead of the year (note that this does not mean that the author is dead!). ",
            "field_short_description": "Corresponding author's email address"
        },{
            "field_name": "Missing Data",
            "name_in_csv": "publication_missing_data",
            "database_model":"publication",
            "field_description": "Data that is not yet available from the publication source or has not yet been digitized. For more information please see missing data meta-table.",
            "field_short_description": "Data currently missing from source"
        },{
            "field_name": "Corresponding Author Reply",
            "name_in_csv": "correspondence_author_reply",
            "database_model":"publication",
            "field_description": "Did the author reply to a request for further information. This should record a brief answer given by the author, or No (no response yet). Note: Always change Reply from NA or Nothing to No when author has been contacted, and update the entry as soon as a reply is received. Always reply to the author with a short thank-you note when a reply is received.",
            "field_short_description": "Response from corresponding author after missing data request"
        },{
            "field_name": "Corresponding Author Content Email",
            "name_in_csv": "correspondence_email_content",
            "database_model":"publication",
            "field_description": "Data that is not available from the publication source and the corresponding author has been contacted for. For more information please see contact author meta-table. If the author has been asked for something other than the standard missing information, a short note should be left in the extra content email field, e.g. is the species clonal?.",
            "field_short_description": "Additional data that requested from the author via email."
        },{
            "field_name": "Corresponding Author Contacted",
            "name_in_csv": "date_author_contacted",
            "database_model":"publication",
            "field_description": "Record the date when the publication author was first contacted asking for information. Authors should always be contacted from the compadrecontact@gmail.com email address rather than a personal email address. For more information on contacting authors, please see the contact author meta-table.",
            "field_short_description": "The date when the publication author was first contacted asking for additional information."
        }, {
            "field_name": "Corresponding Author Contacted Again",
            "name_in_csv": "date_author_contacted_again",
            "database_model":"publication",
            "field_description": "Record the date when the author was most recently contacted since the first date of contact (see Corresponding Author Contacted)",
            "field_short_description": "most recent date of the corresponding author was contacted (if different from first date of contact)"
        }, {
            "field_name": "Corresponding Extra Content Email",
            "name_in_csv": "extra_content_email ",
            "database_model":"publication",
            "field_description": "If the author has been asked for something other than the standard missing information (see contact author meta-table, a short note should be left in this field. For example, is the species clonal?.",
            "field_short_description": "Author contacted for additional information not in contact author meta-table"
        },{
            "field_name": "Date Digitized",
            "name_in_csv": "publication_date_digitization",
            "database_model":"publication",
            "field_description": "This column records the date when the COMPADRINO started working on this publication. Specifically when the first matrix population model of that study was digitised. Dates should be recorded in the following date format: yyyy-mm-dd, e.g. 2015-12-25 for 25th Dec 2015.",
            "field_short_description": "This column records the date when the COMPADRINO started working on this publication"
        },{
            "field_name": "Ecoregion",
            "name_in_csv": "population_ecoregion",
            "database_model":"population",
            "field_description": "Description of the Ecoregion for the study, using the categories described in Figure 1 of Olson et al. (2001). For more information, please visit the github wiki at",
            "field_short_description" : "Description of the Ecoregion for the study"
        },{
            "field_name": "Publication Protocol",
            "name_in_csv": "publications_protocol",
            "database_model":"publication",
            "field_description":"For Compadrino usage during digitization. A publication will be assigned a code depending on what stage of digitization it is currnetly at. For example, if a publication and all of it's meta-data is complete and has been released it will be assigned a 7. For more information, please see the publications protocol meta-table.",
            "field_short_description": "Compadrino digitization method. Please see publication protocol metatable and assign appropriately"
        },{
            "field_name": "Altitude",
            "name_in_csv": "population_altitude",
            "database_model":"population",
            "field_description": "Altitude of studied population in m = Height above sea level of specific population in meters e.g. 208m. Height is either given in the paper, by author communication, or we look it up with Google Maps or Google Earth. If you enter the coordinates into Google Maps you’ll see the altitude at the bottom right corner of the window. If you scroll around in Google maps with your mouse the altitude will change, so pay attention that you read the altitude directly after entering the coordinates without scrolling around!",
            "field_short_description": "Altitude of studied population in m = Height above sea level of specific population in meters e.g. 208m."
        },{
            "field_name": "Continent",
            "name_in_csv": "population_continent",
            "database_model":"population",
            "field_description": "Continent where study took place. Africa, Asia, Europe, N American, S America, Antarctica, Oceania (see en.wikipedia.org wiki List_of_Oceanian_countries_by_population)",
            "field_short_description": "Continent where study took place"
        },{
            "field_name": "Country",
            "name_in_csv": "population_country",
            "database_model":"population",
            "field_description": "The ISO 3 Country Code(s) of where the study took place. Please see, en.wikipedia.org wiki ISO_3166-1_alpha-3. Where studies are conducted in seas or oceans this becomes a bit more challenging, in this instance we put the closest country to the point of interest and then complete the field population_nautical_miles, for example, FRA, NODC-22 = 22 nautical miles away from France",
            "field_short_description": "The ISO 3 Country Code(s) of where the study took place"
        },{
            "field_name": "Invasive Status Elsewhere",
            "name_in_csv": "population_invasive_status_elsewhere",
            "database_model":"population",
            "field_description": "Global invasive status collected by Kim Jelbert and Danny Buss at the University of Exeter. Protocol still TBC. For more information, please see population_invasive_status_elsewhere metatable",
            "field_short_description": "Invasive status of the species globally"
        },{
            "field_name": "Invasive Status Study",
            "name_in_csv": "population_invasive_status_study",
            "database_model":"population",
            "field_description": "Local population invasive status collected by Kim Jelbert and Danny Buss at the University of Exeter. Protocol still TBC. For more information, please see population_invasive_status_study metatable",
            "field_short_description": "Invasive status of the local population studied"
        },{
            "field_name": "Latitude",
            "name_in_csv": "population_latitude",
            "database_model":"population",
            "field_description": "Decimal Degree Values of Latititude. Always check geolocation with Google Earth! If the geolocation from Google Earth does not fit the study site description ask author for further information and use one of the comments for the Observation. The following link is useful for converting between different ways of presenting lat or long information: www.earthpoint.us Convert.aspx",
            "field_short_description": "Geolocation, Decimal Degree Values of Latititude"
        },{
            "field_name": "LatNS",
            "name_in_csv": "lat_ns",
            "database_model":"population",
            "field_description": "Cardinal direction, N - North, S - South. Note: Cardinal direction might be given with a “+” or “-“ whereat “+” means North and “-“ means South.",
            "field_short_description": "Geolocation, Latitudinal Cardinal Direction"
        },{
            "field_name": "LatDeg",
            "name_in_csv": "lat_deg",
            "database_model":"population",
            "field_description": "Record the degree (0-90), minute (0-60) and second (0-60) values of the locations of the matrix. If no LatSec is available type in a zero. This means: the value 0 may mean precise values are not available! If the geolocation is given as e.g. 58° 06' N 17° 26' E we do not enter 06 into the LatMin or LatSec column but only 6. Note: if there are no seconds (or minutes) given, you should record as NA rather than 0.",
            "field_short_description": "Geolocation, DEGREES, minutes and seconds"
        },{
            "field_name": "LatMin",
            "name_in_csv": "lat_min",
            "database_model":"population",
            "field_description": "Record the degree (0-90), minute (0-60) and second (0-60) values of the locations of the matrix in the following fields: LatDeg, LatMin and LatSec. If no LatSec is available type in a zero. This means: the value “0” may mean precise values are not available! If the geolocation is given as e.g. 58° 06' N 17° 26' E we do not enter 06 into the LatMin or LatSec column but only 6. Note: if there are no seconds (or minutes) given, you should record as NA rather than 0.",
            "field_short_description": "Geolocation, degrees, MINUTES and seconds"
        },{
            "field_name": "LatSec",
            "name_in_csv": "lat_sec",
            "database_model":"population",
            "field_description": "Record the degree (0-90), minute (0-60) and second (0-60) values of the locations of the matrix. If no LatSec is available type in a zero. This means: the value 0 may mean precise values are not available! If the geolocation is given as e.g. 58° 06' N 17° 26' E we do not enter 06 into the LatMin and LatSec column but only 6. Note: if there are no seconds (or minutes) given, you should record as NA rather than 0.",
            "field_short_description": "Geolocation, degrees, minutes and SECONDS"
        },{
            "field_name": "Longitude",
            "name_in_csv": "population_longitude",
            "database_model":"population",
            "field_description": "Decimal Degree Values of Longitude. Always check geolocation with Google Earth! If the geolocation from Google Earth does not fit the study site description ask author for further information and use one of the comments for the Observation. The following link is useful for converting between different ways of presenting lat or long information: www.earthpoint.us Convert.aspx",
            "field_short_description": "Gelocation, Decimal Degree Values of Longitude"
        },{
            "field_name": "LonWE",
            "name_in_csv": "lon_ew",
            "database_model":"population",
            "field_description": "Cardinal direction, W - West, E - East. Note: Cardinal direction might be given with a “+” or “-“ whereat “+” means East and “-“ means West. ",
            "field_short_description": "Geolocation, Longitudinal Cardinal Direction"
        },{
            "field_name": "LonDeg",
            "name_in_csv": "lon_deg",
            "database_model":"population",
            "field_description": "Record the degree (0-90), minute (0-60) and second (0-60) values of the locations of the matrix in the following fields: LonDeg, LonMin, LonSec. If no LonSec is available type in a zero. This means: the value 0 may mean precise values are not available! If the geolocation is given as e.g. 58° 06' N 17° 26' E we do not enter 06 into the LonMin and LonSec column but only 6. Note: if there are no seconds (or minutes) given, you should record as NA rather than 0.",
            "field_short_description": "Geolocation, DEGREES, minutes and seconds"
        },{
            "field_name": "LonMin",
            "name_in_csv": "lon_min",
            "database_model":"population",
            "field_description": "Record the degree (0-90), minute (0-60) and second (0-60) values of the locations of the matrix in the following fields: LonDeg, LonMin, LonSec. If no LonSec is available type in a zero. This means: the value “0” may mean precise values are not available! If the geolocation is given as e.g. 58° 06' N 17° 26' E we do not enter 06 into the LonMin or LonSec column but only 6. Note: if there are no seconds (or minutes) given, you should record as NA rather than 0.",
            "field_short_description": "Geolocation, degrees, MINUTES and seconds"
        },{
            "field_name": "LonSec",
            "name_in_csv": "lon_sec",
            "database_model":"population",
            "field_description": "Record the degree (0-90), minute (0-60) and second (0-60) values of the locations of the matrix in the following fields: LonDeg, LonMin, LonSec. If no LonSec is available type in a zero. This means: the value “0” may mean precise values are not available! If the geolocation is given as e.g. 58° 06' N 17° 26' E we do not enter 06 into the LonMin or LonSec column but only 6. Note: if there are no seconds (or minutes) given, you should record as NA rather than 0.",
            "field_short_description": "Geolocation, degrees, minutes and SECONDS"
        },{
            "field_name": "Population Name",
            "name_in_csv": "population_name",
            "database_model":"population",
            "field_description": "The name of population where the matrix was recorded, usually as given by the publication author. For example “Brazeau Creek, Florida”. When the author provides no name, the closest geographic location is assigned as name. If there are multiple populations in the study and their names are not pertinent or available, sequential names in alphabetical order are assigned for each population in the study, separated by (e.g. A; B; C; etc).",
            "field_short_description": "The name of population where the matrix was recorded"
        },{
            "field_name": "Population Size",
            "name_in_csv": "population_pop_size",
            "database_model":"population",
            "field_description": "The total number or abundance of individuals within the population in the stated year. Not always available.",
            "field_short_description": "Total number of individuals"
        },{
            "field_name": "Institute Source",
            "name_in_csv": "study_database_source",
            "database_model":"population",
            "field_description": "The institute that collated the data together in a mini database before COMPADRE and COMADRE were developed",
            "field_short_description": "Previous institute data collation efforts"
        },{
            "field_name": "Study Duration",
            "name_in_csv": "study_duration",
            "database_model":"population",
            "field_description": "Records the number of years of observation, e.g. 5. This is calculated as: “StudyEnd” year - “StudyStart” year + 1. The calculation thus overlooks any missing years in the middle of the study period. Note that Excel should calculate the StudyDuration automatically since the formula is already set as default for that column. If it is not calculated by Excel please enter formula (not a calculated number) in case we get better information later.",
            "field_short_description": "The number of years of observation per population"
        },{
            "field_name": "Study End",
            "name_in_csv": "study_end",
            "database_model":"population",
            "field_description": "Records the last year that the population was studied, e.g. 2012",
            "field_short_description": "The last year that the population was studied"
        },{
            "field_name": "Number of populations",
            "name_in_csv": "study_number_populations",
            "database_model":"population",
            "field_description": "The number of populations of the study species within a single publication. This could be any integer value and refers to the number of populations as defined by the author. Within-site replication of permanent plots are not considered to be different populations.",
            "field_short_description": "he number of populations of the study species per publication"
        },{
            "field_name": "Study purpose endangered",
            "name_in_csv": "study_purpose_endangered",
            "database_model":"population",
            "field_description": "Whether the aims of the individual study was to done to explore the demogaphy of an endangered species",
            "field_short_description": "The study focoused on th demography of an endangered species"
        },{
            "field_name": "Study purpose weed",
            "name_in_csv": "study_purpose_weed",
            "database_model":"population",
            "field_description": "Whether the aims of the individual study was to done to explore the demogaphy of a pest species",
            "field_short_description": "The study focoused on th demography of a pest species"
        },{
            "field_name": "Study Start",
            "name_in_csv": "study_start",
            "database_model":"population",
            "field_description": "Records the first year that the population was studied, e.g. 2012",
            "field_short_description": "The first year that the population was studied"
        },{
            "field_name": "Nautical Miles",
            "name_in_csv": "population_nautical_miles",
            "database_model":"population",
            "field_description": "For oceanic studies, this is the distance in nautical miles from the closest land mass. If the population was studied both in French and Spanish waters 22 miles from land the country code field would be FRA; SPA and the nautical miles field would be NODC-22. If it was only studied in international waters (normally defined as 12 nautical miles (for explanation see here) then you would record it as NODC-22",
            "field_short_description": "The distance in nautical miles from the closest land mass"
        },{
            "field_name": "DatabaseVersionRelease",
            "name_in_csv": "database_master_version",
            "database_model":"population",
            "field_description": "The Version number of the database where the data is or will be released. e.g. 3.0.0, 3.1.0. Where the data are not yet to be released (for example, because the data are incomplete) an X is used in place of a version number. For all future digitization, an X should be placed in the version record. These will be replaced with an appropriate version number by Owen or Rob only at a later date when a final check is done to release more data periodically.",
            "field_short_description": "Version number of the database when this data was released"
        },{
            "field_name": "CensusTiming",
            "name_in_csv": "fixed_census_timing",
            "database_model":"Fixed",
            "field_description": "When the population was studied in relation to flowering timing of the species. Pre - before flowering census, post - after flowering census, flow - censused continually throughout the year ",
            "field_short_description": "When the population was studied in relation to flowering timing of the species"
        },{
            "field_name": "Matrix Independence Flag",
            "name_in_csv": "fixed_independence_flag",
            "database_model":"Fixed",
            "field_description": "A true or flase field highlighting whether the matrix is independent and if it is not independent that it is ok to use without having pseudoreplication issues within your study set. This is a field that hasn't yet been complete by the University of Exeter",
            "field_short_description": "True - can use without pseudoreplication in comparative analyses, False - cannot use without pseudoreplication in comparative analyses"
        },{
            "field_name": "SeedStage Error",
            "name_in_csv": "fixed_seed_stage_error",
            "database_model":"Fixed",
            "field_description": "During matrix construction, the author has commited the seeds error. For more information, please visit our educational page: or see Caswell etc.",
            "field_short_description": "During matrix construction, the author has commited the seeds error"
        },{
            "field_name": "Small",
            "name_in_csv": "fixed_small",
            "database_model":"Fixed",
            "field_description": "The method the author used to construct fecundities. None - counted seeds in the field, Focused - counted the number of seeds on a few specific adult plants, flowers or fruits and multiplied this by the population size, Lab - Used laboratory or greenhouse experiments to estimate fecundity rates",
            "field_short_description": "The method the author used to construct fecundities"
        },{
            "field_name": "Growth Form Raunkiaer",
            "name_in_csv": "trait_growth_form_raunkiaer",
            "database_model":"Trait",
            "field_description": "Plant classification according to Raunkiaer (classified after the position of the overwintering buds). Enter NA for animals etc. For more information please see the relevant metatable and the wiki pages on the github - github.com Spandex-at-Exeterdemography_database wiki Growth-Form-Raunkiaer",
            "field_short_description": "Plant classification according to Raunkiaer"
        },{
            "field_name": "matrix_a_string",
            "name_in_csv": "matrix_a_string",
            "database_model":"Matrix",
            "field_description": "The population matrix model containing all vital rates. The A matrix - Transition probabilities are constrained between 0 and 1. Reproductive values are always positive but have no upper bound.",
            "field_short_description": "The population matrix model describing total population dynamics and contains all vital rates"
        },{
            "field_name": "matrix_c_string",
            "name_in_csv": "matrix_c_string",
            "database_model":"Matrix",
            "field_description": "The C matrix - The population sub-matrix model C (a sub-matrix of A), which describes the clonal-reproduction dynamics of a population under the conditions described above. A range of numeric values are possible, but these are constrained to be positive. These include only estimates of clonal reproduction.",
            "field_short_description": "The matrix which only describes the clonal-reproduction dynamics of a population"
        },{
            "field_name": "matrix_u_string",
            "name_in_csv": "matrix_u_string",
            "database_model":"Matrix",
            "field_description": "The U matrix - The population sub-matrix model U (a sub-matrix of A), describes the survival-dependent dynamics of a population under the conditions described above. A range of numeric values possible, but are constrained to be between 0 and 1. These include only survival-dependent vital rates (no sexual or clonal reproduction).",
            "field_short_description": "The matrix which only describes the survival-dependent dynamics of a population"
        },{
            "field_name": "matrix_f_string",
            "name_in_csv": "matrix_f_string",
            "database_model":"Matrix",
            "field_description": "The F matrix - The population sub-matrix model F (a sub-matrix of A), which describes the sexual-reproduction dynamics of a population under the conditions described above. A range of numeric values possible, but are constrained to be positive. These include only estimates of sexual reproduction (no clonal reproduction).",
            "field_short_description": "The matrix which only describes the sexual-reproduction dynamics of a population"
        },{
            "field_name": "StudyDifficulty",
            "name_in_csv": "matrix_difficulty",
            "database_model":"Matrix",
            "field_description": "This indicates how difficult the MPM information was to extract from the paper. It is recorded on a 3 point scale (values of 1, 2, 3), with 1 being easy to 3 being hard. For more information, please see the github wiki - github.com Spandex-at-Exeter demography_database wiki Matrix-Difficulty",
            "field_short_description": "This indicates how difficult the MPM information was to extract from the paper (1 - easy, 2-medium, 3- hard)"
        },{
            "field_name": "MatrixCaptivity",
            "name_in_csv": "matrix_captivity",
            "database_model":"Matrix",
            "field_description": "Indicates whether the study species was studied in the wild (W) or under controlled conditions (C) for most of its lifecycle. For more information, please see matrix_captivity metatable",
            "field_short_description": "Indicates whether the study species was studied in the wild (W) or under controlled conditions (C)"
        },{
            "field_name": "StudyChecked",
            "name_in_csv": "matrix_checked_count",
            "database_model":"Matrix",
            "field_description": "This variable records how much the MPM has been checked by us. It is a numeric variable that gets incremented by +1 each time the data in a set of matrices for a particular publication are checked. The first time the data are entered, StudyChecked is 0 (it has been entered not checked). Then, if for whatever reason we revisit the paper or data to check details, we add 1 to the number. e.g. an study that has been entered, then checked twice should have a value of 2.",
            "field_short_description": "It is a numeric variable that gets incremented by +1 each time the data in a set of matrices for a particular publication are checked"
        },{
            "field_name": "MatrixClassAuthor",
            "name_in_csv": "matrix_class_author",
            "database_model":"Matrix",
            "field_description": "The stage description as indicated in the source by the publication author of the matrix population model. When possible, we add units (e.g. cm, m, cm^2^). Some information on how to correctly write things in that column: First letter must be a capital letter (e.g. Adult: 100-150 cm DBH). If the Author uses abbreviations first write them down, followed by a “:” and the explanation of that abbreviations. Always add units (when possible) (e.g. 0-9 cm DBH, not 0-9 DBH). Be clear in what is described (e.g. 0-9 cm DBH or height, not only 0-9 cm). Make sure that you use . Instead of , when typing numbers (e.g. 1.45 cm, not 1,45 cm). Make sure that there is space between the number and the unit (e.g. 1.45 cm, not 1.45cm). We use exact the same description as the author did. If the paper is in another language (e.g. all the Spanish stuff from Iriondo Book 2009) we also write down the stages in that foreign language (e.g. in Spanish). Also write down abbreviations - if the author used them frequently (e.g. if the author explains his stages in the text and after that only uses S1, S2, J1, J2, J3, A, R write them down, too (= s1 = dormant seeds).",
            "field_short_description": "The stage description of each MPM as indicated in the source by the publication author"
        },{
            "field_name": "MatrixClassNumber",
            "name_in_csv": "matrix_class_number",
            "database_model":"Matrix",
            "field_description": "A numerical representation of classes in the population matrix model. For more information, please see MatrixClassAuthor descriptions. Numbers starting with 1 (not 0). e.g. 1,2,3, ... $n$, where $n$ is the dimension of the population matrix.",
            "field_short_description": "A numerical representation of classes in the population matrix model"
        },{
            "field_name": "MatrixClassOrganized",
            "name_in_csv": "matrix_class_organized",
            "database_model":"Matrix",
            "field_description": "We standardise all stages in a given population matrix model to one of three stages (prop, active, dorm) to facilitate analyses. prop - Propagule (seed). This applies to every stage defined by the author as seed bank or seed. Users are encouraged to carefully examine matrices with these stages and to implement the appropriate calculations to avoid a spurious additional year being added when no seedbank exists in the study species, as explained by Caswell (2001, p. 60). active - This includes stages that can neither be placed in the “prop” nor “dorm” (see below) stages. dorm - A stage that is vegetatively dormant after having germinated and becoming established.",
            "field_short_description": "standardised descriptions of stages in a given population matrix model (prop, active, dorm)"
        },{
            "field_name": "MatrixComplete",
            "name_in_csv": "matrix_complete",
            "database_model":"Matrix",
            "field_description": "A true flase field indicating whether the matrix is complete or has NA's within it. This is a house-keeping field for the COMPADRINOs and makes subsetting easy for analysis.",
            "field_short_description": "A true flase field indicating whether the matrix is complete or has NA's within it"
        },{
            "field_name": "MatrixComposite",
            "name_in_csv": "matrix_composition",
            "database_model":"Matrix",
            "field_description": "Indicates the type of matrix population model. For example, Individual - A matrix population model constructed for a single study × species × population × treatment × period combination (See the matrix composition metatable for more information).",
            "field_short_description": "Indicates the type of matrix population model"
        },{
            "field_name": "MatrixCriteriaAge",
            "name_in_csv": "matrix_criteria_age",
            "database_model":"Matrix",
            "field_description": "Records whether there are any classes that are based on age. Yes - The matrix population model contains at least one class that is based on age (e.g. individuals of 0 year old). No - The matrix population model is not based on age",
            "field_short_description": "Records whether there are any classes that are based on age."
        },{
            "field_name": "MatrixCriteriaOntogeny",
            "name_in_csv": "matrix_criteria_ontogeny",
            "database_model":"Matrix",
            "field_description": "Records whether the matrix model is based on ontogenetic stage (e.g. seedbank, reproductive, vegetative, dormant, etc). Yes - The matrix population model contains at least one class that is based on development or ontogeny (e.g. seedbank, reproductive, vegetative, dormant, etc). No - Matrix population model is not based on ontogeny. ",
            "field_short_description": "Records whether the matrix model is based on ontogenetic stage (e.g. seedbank, reproductive, vegetative, dormant, etc)."
        },{
            "field_name": "MatrixCriteriaSize",
            "name_in_csv": "matrix_criteria_size",
            "database_model":"Matrix",
            "field_description": "Records whether the matrix model is based on size (e.g. stem length or number, body length or mass, etc). Yes - The matrix population model contains stages based on size and this briefly describes the aspect of size that was measured to classify individuals (e.g. DBH, stem length, stem height, stem number, etc). No - The matrix population model is not based on size.",
            "field_short_description": "Records whether the matrix model is based on size (e.g. stem length or number, body length or mass, DBH, stem length, stem height, stem number, etc)."
        },{
            "field_name": "MatrixDimension",
            "name_in_csv": "matrix_dimension",
            "database_model":"Matrix",
            "field_description": "the number of stage or age or ontogeny classes within the MPM. For example, a 3 x 3 matrix would have a matrix dimension of 3.",
            "field_short_description": "the number of stage or age or ontogeny classes within the MPM"
        },{
            "field_name": "MatrixEndMonth",
            "name_in_csv": "matrix_end_month",
            "database_model":"Matrix",
            "field_description": "Numeric indication of the last month of study. Month m in periodic matrix population model that describes population dynamics from month m to m+1. e.g. 1 - January, 6 - June, 12 - Decmeber.",
            "field_short_description": "Numeric indication of the first month of study."
        },{
            "field_name": "MatrixStartMonth",
            "name_in_csv": "matrix_start_month",
            "database_model":"Matrix",
            "field_description": "Numeric indication of the first month of study. Month m in periodic matrix population model that describes population dynamics from month m to m+1. e.g. 1 - January, 6 - June, 12 - Decmeber.",
            "field_short_description": "Numeric indication of the first month of study"
        },{
            "field_name": "MatrixEndSeason",
            "name_in_csv": "matrix_end_season",
            "database_model":"Matrix",
            "field_description": "Numeric indication of the last season of study. 1 - Spring, 2 - Summer, 3 - Autumn, 4 - Winter. Seasons are naturally hemisphere-specific, and this information can be deduced from variables Country and LatDeg.",
            "field_short_description": "Numeric indication of the last season of study. 1 - Spring, 2 - Summer, 3 - Autumn, 4 - Winter"
        },{
            "field_name": "MatrixStartSeason",
            "name_in_csv": "matrix_start_season",
            "database_model":"Matrix",
            "field_description": "Numeric indication of the first season of study. 1 - Spring, 2 - Summer, 3 - Autumn, 4 - Winter. Seasons are naturally hemisphere-specific, and this information can be deduced from variables Country and LatDeg.",
            "field_short_description": "Numeric indication of the first season of study. 1 - Spring, 2 - Summer, 3 - Autumn, 4 - Winter"
        },{
            "field_name": "MatrixEndYear",
            "name_in_csv": "matrix_end_year",
            "database_model":"Matrix",
            "field_description": "Last year of study for the given population. Year t+1 in matrix population model that describes population dynamics from time t to t+1. e.g. 2001.",
            "field_short_description": "Last year of study for the given population"
        },{
            "field_name": "MatrixStartYear",
            "name_in_csv": "matrix_start_year",
            "database_model":"Matrix",
            "field_description": "First year of study. Year t in annual matrix population model that describes population dynamics from time t to t+1. e.g. 1995.",
            "field_short_description": "First year of study for the given population"
        },{
            "field_name": "Matrix Fecundity",
            "name_in_csv": "matrix_fec",
            "database_model":"Matrix",
            "field_description": "This records whether fecundity was measured at all for this matrix model (True or False). True - fecundity was measured for the matrix. False - fecundity was not measured for the matrix. The rationale for this is that a fecundity (in the F matrix) may be recorded as 0 either because it was not measured, or because reproduction was estimated to be zero. As a general rule, if any values for fecundity (e.g. in the F matrix) are non-zero, then MatrixFec should be recorded as 'Yes'. If all values are zero, then you should check the paper carefully to check whther this is because no fecundity was detected, or whether no attempt was made to measure fecundity.",
            "field_short_description": "Was fecundity measured and used to calculate matrix values (True or False)?"
        },{
            "field_name": "matrix_independence_origin",
            "name_in_csv": "matrix_independence_origin",
            "database_model":"Matrix",
            "field_description": "This field should state the ID of pre-exisiting matrices. If a matrix is not independent e.g. it has been altered slightly from an original publication due to seeds errors etc. then this will cite the original matrix ID form which it is not indepedent from. If the matrix is an original, this field with be NA.",
            "field_short_description": "The matrix ID of the original matrix this matrix is related to. If no relation enter NA"
        },{
            "field_name": "matrix_independent",
            "name_in_csv": "matrix_independent",
            "database_model":"Matrix",
            "field_description": "A true or flase field stating whether this matrix is independent from all other matrices in the database. True - it is independent. False - it is not independent. Note - if it is not independent the matrix_independence_origin field should contain the ID of the matrices this matrix is related to, whilst the matrix_non_independence field should state why it is not indepdent. For example, this is a seeds corrected matrix of the original matrix ID no. 444 from publication ID no. 12",
            "field_short_description": "A true or flase field stating whether this matrix is independent from all other matrices in the database."
        },{
            "field_name": "matrix_non_independence",
            "name_in_csv": "matrix_non_independence",
            "database_model":"Matrix",
            "field_description": "This describes why a matrix is not independent from other matrices in the database. For example, this is a seeds corrected matrix of the original matrix ID no. 444 from publication ID no. 12. In this instance, the following fields would contain: matrix_independence_origin - 444, matrix_independent - FALSE",
            "field_short_description": "This describes why a matrix is not independent from other matrices in the database"
        },{
            "field_name": "matrix_non_independence_author",
            "name_in_csv": "matrix_non_independence_author",
            "database_model":"Matrix",
            "field_description": "The author or compadrino that recognised that the matrix was not independent and completed the following fields: matrix_independence_origin, matrix_independent, matrix_non_independence. For example, the seeds corrected matrices collated from the Franco & Silvertown database.",
            "field_short_description": "The author or compadrino that recognised that the matrix was not independent. For example, Franco & Silvertown"
        },{
            "field_name": "Observation",
            "name_in_csv": "matrix_observations",
            "database_model":"Matrix",
            "field_description": "Any useful additional information about the population matrix model that is not provided elsewhere but may nonetheless be important (e.g. plant canopy, burning intervals, etc.) including additional information on the geolocations or matrix treatments. Some standardised sentences: The GPS coordinates were approximated to the closest geographic location described in the reference. (see Geolocation). GPS co-ordinates cited exactly as reported in original paper. These do not match written study site description. (see Geolocation). Geolocation or Altitude from descriptor: (if no matrices are enters yet but a geolocation information are available). Matrix is calculated with stochastic model. X years since last fire. Calculated with demographic data from Author JournalName YearPublished. Data is from a greenhouse experiment. MatrixClassAuthor is not clarified.",
            "field_short_description": "Any useful additional information about this MPM"
        },{
            "field_name": "MatrixPeriodicity",
            "name_in_csv": "matrix_periodicity",
            "database_model":"Matrix",
            "field_description": "Frequency with which seasonal or annual the matrix population model was constructed. For example, 1 - once per year, 2 - twice per year, 0.2 - once every 5 years etc. Annual periodicities can be calculated as follows: If the study site has been visited more than once a year calculate $1 * N$, where N is the number of visits to the site per year, e.g. $1 * 2 = 2$. If the study site has been revisited less than once per year calculate $1 or Y$, where Y is the number of years, e.g. $1 divided by 5 = 0.2$.",
            "field_short_description": "Frequency with which seasonal or annual the matrix population model was constructed"
        },{
            "field_name": "MatrixSeasonal",
            "name_in_csv": "matrix_seasonal",
            "database_model":"Matrix",
            "field_description": "A boolean field that indicates whether the matrix presented was seasonal (true) or not (false).  A matrix population model that does not describe a full annual transition, but rather a seasonal (< 1 yr) transition. A matrix can be seasonal even if a it is constructed over several years e.g. spring in years 2000-2012. A seasonal matrix can also be created from pooled, mean or individual data and therefore we have separated seasonal from the matrix composition column that it was hosted in previously.",
            "field_short_description": "A boolean field that indicates whether the matrix presented was calculated per season (true) or not (false)"
        },{
            "field_name": "MatrixSplit",
            "name_in_csv": "matrix_split",
            "database_model":"Matrix",
            "field_description": "Indicates whether the A matrix population model can be divided into the U, C and F MPMs (divided or indivisible). Divided - The matrix population model A has successfully been divided into the process-based sub matrices U, F and C. Indivisible - The matrix population model A has not been divided into the process-based sub-matrices U, F and C (see Figure below for further details) because insufficient information is available to classify the various demographic processes for each sub-matrix. If a matrix is divisible, we divide it! Then always insert all sub-matrices – even if e.g. C only has zeros! ",
            "field_short_description": "Indicates the type of matrix population model (divided or indivisible)"
        },{
            "field_name": "MatrixStudiedSex",
            "name_in_csv": "matrix_studied_sex",
            "database_model":"Matrix",
            "field_description": "Indication of the sex(es) considered when constructing the matrix population model. M - studied only males. F - studied only females. H - Hermaphrodites. M or F - Males and females separately in the same population matrix model. A - All sexes together. NA - No distinct sexes (e.g. virus).",
            "field_short_description": "Sex considered when constructing the matrix population model. For example, M - Males."
        },{
            "field_name": "MatrixSurvivalIssue",
            "name_in_csv": "matrix_survival_issue",
            "database_model":"Matrix",
            "field_description": "When the components of each column of a PPM matrix add up to more then 1 (exc. fecundity rates). If it is more then 1, then the matrix is stating that over 100% of that stage class is surviving into the next generation, which is not possible.",
            "field_short_description": "When the components of each column of a PPM matrix add up to more then 1 (exc. fecundity rates)"
        },{
            "field_name": "MatrixVectorAbundance",
            "name_in_csv": "matrix_vectors_includes_na",
            "database_model":"Fixed",
            "field_description": "The known initial population structure, represented as the number of individuals. The size of the vector should correspond to the number of dimensions in the PPM of the specific population, but this is not always the case. Please state clearly in the MatrixVectorClassNames field how each class is defined, this is particularly important when the vector class names DO NOT match the Matrix class names. They may not always be presented as an abundance, when presented as a proprtion, please leave this field blank and only complete the MatrixVectorProportional field.",
            "field_short_description": "The original population structure, represented as the number of individuals"
        },{
            "field_name": "MatrixVectorProportional",
            "name_in_csv": "matrix_vectors_proportional",
            "database_model":"Fixed",
            "field_description": "The known initital population structure, represented as the proportion of individuals. The size of the vector should correspond to the number of dimensions in the PPM of the specific population, but this is not always the case. Please state clearly in the MatrixVectorClassNames field how each class is defined, this is particularly important when the vector class names DO NOT match the Matrix class names. They may not always be presented as a proportion, when presented as an abundance, please calculate this field from the known abundances that should be entered into the MatrixVectorAbundance field.",
            "field_short_description": "The original population structure, represented as the proportion of individuals"
        },{
            "field_name": "MatrixVectorClassNames",
            "name_in_csv": "matrix_vector_class_names",
            "database_model":"Fixed",
            "field_description": "The stage description as indicated in the source by the publication author of the known initial population vector. This is only needed when the data for either MatrixVectorAbundance or MatrixVectorProportional are available from the source. When possible, we add units (e.g. cm, m, cm2)",
            "field_short_description": "Stage description for known intial population vector"
        },{
            "field_name": "SpeciesAccepted",
            "name_in_csv": "species_accepted",
            "database_model":"Species",
            "field_description": "Currently accepted Latin name.",
            "field_short_description": "Currently accepted Latin name."
        },{
            "field_name": "SpeciesAuthor",
            "name_in_csv": "species_author",
            "database_model":"Taxonomy",
            "field_description": "The Latin binomial name of the species as reported in the publication. Note that this may not be the same as the currently accepted name. This should be recorded as Genus_species. It should always include the genus and the species names. Where the paper authors have given infra-specific names information on variety and subspecies should also be added (see below). var. - Where the publication refers to an intraspecific variety, this is indicated with var. followed by the variety name, e.g. Pityopsis_aspera_var._aspera subsp. - Where the study refers to an intraspecific subspecies, this is indicated with subsp. followed by the subspecies name, e.g. Anthyllis_vulneraria_subsp._alpicola. The word following “var.”, “subsp.” or “cf.” must not be capitalised. Excel will try to capitalise it via auto-correct because it follows a period punctuation. Always use an underscore to substitute_spaces. If two or more different demographic studies exist for a particular species, these should be digitised with concatenated numbers after the genus_species starting with 2 onwards (e.g. Rosa_sempervirens, Rosa_sempervirens_2, Rosa_sempervirens_3). Note that the first hit does not get a 1 (e.g. Rosa_sempervirens instead of Rosa_sempervirens_1)",
            "field_short_description": "The Latin binomial name of the species as reported in the publication"
        },{
            "field_name": "CommonName",
            "name_in_csv": "species_common",
            "database_model":"Species",
            "field_description": "Records the common name as used in the publication. Separate multiple names with a semi-colon (;). If there is no common name used in the publication, record NA",
            "field_short_description": "Records the common name as used in the publication"
        },{
            "field_name": "GBIF_TaxonKey",
            "name_in_csv": "species_gbif_taxon_key",
            "database_model":"Species",
            "field_description": "A numeric code that is derived from the www.gbif.org website for each SpeciesAccepted. The code is useful to gather species information directly from the gbif database. This code can be scraped using the rGbif package in R or via the GBIF website.",
            "field_short_description": "A numeric code that is derived from the www.gbif.org website for each SpeciesAccepted"
        },{
            "field_name": "Class",
            "name_in_csv": "taxonomy_class",
            "database_model":"Taxonomy",
            "field_description": "Class to which species belongs e.g. Magnoliopsida. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Class to which species belongs e.g. Magnoliopsida"
        },{
            "field_name": "DateOfCheck",
            "name_in_csv": "taxonomy_col_check_date",
            "database_model":"Taxonomy",
            "field_description": "the date when the taxonomy was last checked and known to be up to date",
            "field_short_description": "the date when the taxonomy was last checked and known to be up to date"
        },{
            "field_name": "taxonomy_col_check_ok",
            "name_in_csv": "taxonomy_col_check_ok",
            "database_model":"Taxonomy",
            "field_description": "Whether the taxonomy has been checked by a compadrino to be correct.",
            "field_short_description": "Whether the taxonomy has been checked by a compadrino to be correct."
        },{
            "field_name": "Family",
            "name_in_csv": "taxonomy_family",
            "database_model":"Taxonomy",
            "field_description": "Family to which species belongs e.g. Polygonaceae. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Family to which species belongs e.g. Polygonaceae."
        },{
            "field_name": "Genus",
            "name_in_csv": "taxonomy_genus",
            "database_model":"Taxonomy",
            "field_description": "Genus used in SpeciesAuthor e.g. Chorizanthe. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Genus used in SpeciesAuthor e.g. Chorizanthe."
        },{
            "field_name": "GenusAccepted",
            "name_in_csv": "taxonomy_genus_accepted",
            "database_model":"Taxonomy",
            "field_description": "Genus used in SpeciesAccepted e.g. Chorizanthe. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Genus used in SpeciesAccepted e.g. Chorizanthe."
        },{
            "field_name": "GenusAuthor",
            "name_in_csv": "taxonomy_genus_author",
            "database_model":"Taxonomy",
            "field_description": "Genus used in SpeciesAuthor e.g. Chorizanthe. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Genus used in SpeciesAuthor e.g. Chorizanthe."
        },{
            "field_name": "Kingdom",
            "name_in_csv": "taxonomy_kingdom",
            "database_model":"Taxonomy",
            "field_description": "Kingdom to which species belongs. e.g. Animalia",
            "field_short_description": "Kingdom to which species belongs. e.g. Animalia"
        },{
            "field_name": "Order",
            "name_in_csv": "taxonomy_order",
            "database_model":"Taxonomy",
            "field_description": "Order to which species belongs e.g. Caryophyllales. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Order to which species belongs e.g. Caryophyllales."
        },{
            "field_name": "Phylum",
            "name_in_csv": "taxonomy_phylum",
            "database_model":"Taxonomy",
            "field_description": "Phylum to which species belongs e.g. Magnoliophyta. For more information, please visit our taxonomical classification wiki page on github - github.com Spandex-at-Exeter demography_database wiki Taxonomy-columns.",
            "field_short_description": "Phylum to which species belongs e.g. Magnoliophyta."
        },{
            "field_name": "AngioGymno",
            "name_in_csv": "trait_angio_gymno",
            "database_model":"Trait",
            "field_description": "Whether species is an angiosperm or a gymnosperm (record Angiosperm or Gymnosperm). If it is neither angiosperm nor gymnosperm fill in NA. Use NA for all animals.",
            "field_short_description": "Within the plantae kingdom, is the study species an angiosperm or gymnosperm"
        },{
            "field_name": "DicotMonoc",
            "name_in_csv": "trait_dicot_monoc",
            "database_model":"Trait",
            "field_description": "Whether species is a dicot or monocot (record Eudicot or Monocot). If species is neither dicot nor monocot (i.e. if it is not an angiosperm) fill in NA. Use NA for all animals.",
            "field_short_description": "Within the plantae kingdom, is the study species a Eudicot or Monocot"
        },{
            "field_name": "OrganismType",
            "name_in_csv": "trait_organism_type",
            "database_model":"Trait",
            "field_description": "Basic growth type description used to order species within the database. For example, Tree, Amphibia, Aves. For more more information, please see the following github wiki page: ",
            "field_short_description": "Basic growth type description used to order species within the database"
        },{
            "field_name": "trait_spand_ex_growth_type",
            "name_in_csv": "trait_spand_ex_growth_type",
            "database_model":"Trait",
            "field_description": "A simplified version of the current OrganismType collated by the University of Exeter node. Tree, Shrub, Open Herb, Closed Herb and Monocarp. For more information, please see the metatable.",
            "field_short_description": "A simplified version of the current OrganismType collated by the University of Exeter node"
        },{
            "field_name": "MatrixTreatment",
            "name_in_csv": "matrix_treatment_type",
            "database_model":"Matrix",
            "field_description": "Describes if a treatment was applied or not, and the nature of the treatment. Unmanipulated (no treatment) or a brief description of the treatment applied to the population described by the matrix population model. We define treatment as an action intentionally imposed by humans. Please put all additional treatment information in MatrixObservations. Please see treatment metatable for more information.",
            "field_short_description": "Describes if a treatment was applied or not (unmanipulated), and the nature of the treatment."
        },{
            "field_name": "WithinSiteReplication",
            "name_in_csv": "within_site_replication",
            "database_model":"Population",
            "field_description": "Reports the number of plots or transects sampled at each population and should give an accurate size description of the plots. For example, “6 (4x4 m2)” means that in each population, the authors established and followed six permanent plots of 4x4 m2. Be as specific but as brief as possible.",
            "field_short_description": "Reports the number of plots or transects sampled at each population and should give an accurate size description of the plots."
        },{
            "field_name": "Species_IUCN_TaxonID",
            "name_in_csv": "species_iucn_taxonid",
            "database_model":"Species",
            "field_description": "A numeric code that is derived from the iucn redlist website for each SpeciesAccepted. The code is useful to gather species information directly from the iucn database. This code can be scraped using the rredlist package in R or via the IUCN redlist website.",
            "field_short_description": "A numeric code that is derived from the iucn redlist website for each SpeciesAccepted"
        },{
            "field_name": "species_iucn_population_assessed",
            "name_in_csv": "species_iucn_population_assessed",
            "database_model":"Species",
            "field_description": "The population used to make the IUCN species assessment. If this field is complete, then only a single population for that species was used to make the IUCN species assessment and therefore should be used with caution.",
            "field_short_description": "The population used to make the IUCN species assessment"
        },{
            "field_name": "Species_IUCNstatus",
            "name_in_csv": "species_iucn_status",
            "database_model":"Species",
            "field_description": "A conservation assessment of each species from an independent source - the IUCN. For more information please see the IUCN status metatable and visit the website for new species assessments - www.iucnredlist.org about overview",
            "field_short_description": "A conservation assessment of each species from an independent source - the IUCN"
        },{
            "field_name": "image_path",
            "name_in_csv": "image_path",
            "database_model":"Species",
            "field_description": "The first available html image linked for each species from the EOL website.",
            "field_short_description": "The first available html image linked for each species from the EOL website."
        },{
            "field_name": "image_path2",
            "name_in_csv": "image_path2",
            "database_model":"Species",
            "field_description": "The second available html image linked for each species from the EOL website.",
            "field_short_description": "The second available html image linked for each species from the EOL website."
        },{
            "field_name": "Species_GISDstatus",
            "name_in_csv": "species_gisd_status",
            "database_model":"Species",
            "field_description": "An assessment of each species from an independent source as to whether that species is globally renound for being invasive (TRUE or FALSE) - from the IUCN. For more information please visit the website for new species assessments - www.iucngisd.org gisd or use the gisd function in the originR R package.",
            "field_short_description": "Is the species globally known as invasive according to iucngisd.org (TRUE or FALSE)"
        },{
            "field_name": "Clonality",
            "name_in_csv": "clonality",
            "database_model":"Trait",
            "field_description": "Is the species known to reproduce clonally? True - Yes, the species can reproduce clonally. False - No, there is no evidence that this species can reproduce clonally.",
            "field_short_description": "Is the species known to reproduce clonally (TRUE or FALSE)?"
        },{
            "field_name": "ClonalitySource",
            "name_in_csv": "clonality_source",
            "database_model":"Trait",
            "field_description": "If the species is known to reproduce clonally, what evicence provided this information? Please state citations of articles or sources, if more then one source please seperate by a ;",
            "field_short_description": "Citation evidence for clonality of each species"
        },{
            "field_name": "Seedbank",
            "name_in_csv": "seedbank",
            "database_model":"Trait",
            "field_description": "Is there evidence to suggest this species has a seedbank? True - Yes, the species does have a seedbank. False - No, there is no evidence that this species has a seedbank.",
            "field_short_description": "Is this species known to have a seedbank (TRUE or FALSE)?"
        },{
            "field_name": "SeedbankSource",
            "name_in_csv": "seedbank_source",
            "database_model":"Trait",
            "field_description": "If the species is known to have a seed bank, what evicence provided this information? Please state citations of articles or sources, if more then one source please seperate by a ",
            "field_short_description": "Citation evidence for seedbank presence or absence of each species"
        }],

        "Common_values": [{
                "common_value_name": "Not available",
                "common_value_data": "NA",
                "common_value_description": "The information is not available either because the author does not have it or because the information is not recognized as priority for the digitisation."
        }, {
                "common_value_name": "Asked for it",
                "common_value_data": "AFI",
                "common_value_description": "The information is not yet in the database, but the COMPADRino has already contacted the author requesting it (i.e. the author has not yet replied)."
        }, {
                "common_value_name": "Not digitized yet",
                "common_value_data": "NDY",
                "common_value_description": "The information has not yet been digitised. This is likely to occur when some priority information has been digitised for a given species, and the COMPADRino has moved onto another species without contacting an author for the missing information."
        }, {
                "common_value_name": "Not calculated",
                "common_value_data": "NC",
                "common_value_description": "Information was not calculated because its calculation is not sensible. For instance, latitudes and longitudes of various populations of the same species are not averaged and assigned to the grand-mean population matrix of the species. This is the same for ranges, where author provides a range of latitudes and longitudes for a given population. Ranges are instead noted in the observation column."
        }, {
                "common_value_name": "Laboratory",
                "common_value_data": "LAB",
                "common_value_description": "The author collected demographic data for the studied species in a laboratory or under greenhouse conditions. Controlled, typically indoor, conditions that mean the study population is not affected by the environmental conditions typical of the actual geographic location of the study. For these data we do not calculate averages or ranges but instead enter LAB (not NA)."
        }, {
                "common_value_name": "Frankenstein matrix",
                "common_value_data": "FRANK",
                "common_value_description": "Frankenstein matrices are MPMs where the author parameterised their model using demographic data from 2+ other papers or sources. These MPMs should be clearly indicated with FRANK in the observation column. Furthermore, for these matrices, temporal and geographic information is not useful for comparative analyses and therefore geographic location data, time information (start or end year, season etc.) should be recorded as FRANK (not NA)."
        }, {
                "common_value_name": "A simulated matrix",
                "common_value_data": "Simulation",
                "common_value_description": "The matrix model is a simulation, and perhaps only loosely based on a specific real species. Typically these simulated matrices are used to explore the behaviour of a population in a theoretical way. In those cases, there is no geographic location, ecoregion etc. For these data we do not calculate averages or ranges for locations and time periods but instead enter Simulation (not NA)."
        }]
    }   
}